/*
https://solvesql.com/problems/olympic-cities/

최근 올림픽이 개최된 도시
난이도 1
출제자 [데이터리안] 민주

정답률 33.87% (1246회 / 3679회)

역대 올림픽 정보 데이터셋은 역대 올림픽 경기와 관련된 데이터가 들어있는 테이블로 이루어져 있습니다. 그 중 games 테이블은 역대 올림픽 개최년도와 시즌, 도시 기록이 저장되어 있습니다.
2000년 이후 올림픽이 개최된 도시의 이름을 앞에서부터 3글자만 추출하는 쿼리를 작성해주세요. 쿼리 결과에는 올림픽 개최년도와 개최 도시만 출력되도록 하되, 도시 이름은 대문자로 출력되어야합니다.
쿼리 결과에는 아래 두 개의 컬럼이 있어야하고, 결과는 최근에 개최된 도시부터 내림차순으로 정렬되어있어야 합니다.
year - 올림픽 개최년도
city - 올림픽 개최도시 (3글자)

*/

SELECT year, upper(substr(city, 1, 3)) city
FROM games
WHERE year >= 2000
ORDER BY year desc
;
